app/src/main/assets/soap/request_bipro480-vertrag.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://www.w3.org/2011/03/ws-enu" xmlns:add="http://www.w3.org/2005/08/addressing" xmlns:bas="http://www.bipro.net/namespace/basis" xmlns:vt="http://www.bipro.net/namespace/kontext/vertrag" xmlns:all="http://www.bipro.net/namespace/allgemein">
${soapHeader}
    <soapenv:Body>
        <ws:Enumerate>
            <ws:NewContext>
                <ws:Filter Dialect="http://www.bipro.net/namespace/kontext/vertrag">
                    <vt:Filter xsi:type="vt:CT_Vertragssuche">
                        <!--#IFDEF ${partner}--><vt:Partnernummer>${partner}</vt:Partnernummer><!--/#IFDEF-->
                        <!--#IFDEF ${vsnr}--><vt:Versicherungsscheinnummer>${vsnr}</vt:Versicherungsscheinnummer><!--/#IFDEF-->
                        <!--#IFDEF ${vorgang}--><vt:Vorgangsnummer>${vorgang}</vt:Vorgangsnummer><!--/#IFDEF-->
                        <!--#IFDEF ${vunr}--><vt:Unternehmen><all:Nummer>${vunr}</all:Nummer></vt:Unternehmen><!--/#IFDEF-->
                    </vt:Filter>
                </ws:Filter>
            </ws:NewContext>
            <ws:MaxItems>100</ws:MaxItems>
        </ws:Enumerate>
    </soapenv:Body>
</soapenv:Envelope>